docs(diagrams): fixing up diagrams
